{"keras_version": "2.0.8", "config": [{"class_name": "Dense", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dtype": "float32", "trainable": true, "units": 10, "activity_regularizer": null, "batch_input_shape": [null, 1], "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_1", "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "units": 8, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_2", "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "units": 6, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_3", "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "units": 4, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_4", "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "units": 2, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_5", "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "units": 1, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_6", "kernel_regularizer": null, "kernel_constraint": null}}], "backend": "tensorflow", "class_name": "Sequential"}